dvp-win32.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Using dvp under Win32</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Using dvp under Win32"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-11-26"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Using dvp under Win32</h1>

<p>In a previous blog I posted, I mentioned I was using dvp under Win32 with a custom AutoHotKey (AHK) script I wrote. Now I have abandoned that script. For 2 reasons: 
</p>
<ul>
<li>It does not work on some programs/input boxes, not sure why, but
  google suggests maybe because they are run in SYSTEM account&hellip;

</li>
<li>It fails to translate key presses occasionally. This is because the
  low level KeyboardHook/SendInput Win32 mechanism it employs is a
  half-baked buggy system itself.
</li>
</ul>


<p>
Now I have switched to the kbddvp.dll provided by dvp creator Roland
Kaufmann, and also solved the Chinese IME problem, turns out I only
need to point the "Layout File" of my IME to "kbddvp.dll" in the registry: 
</p>



<pre class="example">Windows Registry Editor Version 5.00

[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layouts\E0350804]
"Ime File"="ywbhj35.dll"
"Layout File"="kbddvp.dll"
"Layout Text"="Chinese (Simplified) - YWB35"
</pre>


<p>
There comes another problem through: cygwin-x does not work with my
new solution. In fact, cygwin-x has nothing to do with Win32 keyboard
layout/IME. Xwindows has its own keyboard layout mechanism. Sadly, dvp
is not part of cygwin-x yet.
</p>
<p>
But I can live with that, since the 2 most fundamental GUI programs I
use, terminal emulator and emacs, both I can do without X. I use
mintty and emacs-nt, both of which are not X programs.
</p></div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
